src/conf/xml-resources/web-services/OseTett/wsdl/ose-test.com/ol-ti-itcpe/billService.svc.wsdl_wsdl0.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions targetNamespace="http://service.sunat.gob.pe" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://service.sunat.gob.pe" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"><wsdl:types><xsd:schema targetNamespace="http://service.sunat.gob.pe/Imports"><xsd:import schemaLocation="https://ose-test.com/ol-ti-itcpe/billService.svc?xsd=xsd0" namespace="http://service.sunat.gob.pe"/></xsd:schema></wsdl:types><wsdl:message name="sendSummaryRequest"><wsdl:part name="parameters" element="tns:sendSummary"/></wsdl:message><wsdl:message name="sendSummaryResponse"><wsdl:part name="parameters" element="tns:sendSummaryResponse"/></wsdl:message><wsdl:message name="IbillService_sendSummary_message_FaultMessage"><wsdl:part name="detail" element="tns:message"/></wsdl:message><wsdl:message name="getStatusRequest"><wsdl:part name="parameters" element="tns:getStatus"/></wsdl:message><wsdl:message name="getStatusResponse"><wsdl:part name="parameters" element="tns:getStatusResponse"/></wsdl:message><wsdl:message name="IbillService_getStatus_message_FaultMessage"><wsdl:part name="detail" element="tns:message"/></wsdl:message><wsdl:message name="sendPackRequest"><wsdl:part name="parameters" element="tns:sendPack"/></wsdl:message><wsdl:message name="sendPackResponse"><wsdl:part name="parameters" element="tns:sendPackResponse"/></wsdl:message><wsdl:message name="IbillService_sendPack_message_FaultMessage"><wsdl:part name="detail" element="tns:message"/></wsdl:message><wsdl:message name="getStatusCdrRequest"><wsdl:part name="parameters" element="tns:getStatusCdr"/></wsdl:message><wsdl:message name="getStatusCdrResponse"><wsdl:part name="parameters" element="tns:getStatusCdrResponse"/></wsdl:message><wsdl:message name="IbillService_getStatusCdr_message_FaultMessage"><wsdl:part name="detail" element="tns:message"/></wsdl:message><wsdl:message name="sendBillRequest"><wsdl:part name="parameters" element="tns:sendBill"/></wsdl:message><wsdl:message name="sendBillResponse"><wsdl:part name="parameters" element="tns:sendBillResponse"/></wsdl:message><wsdl:message name="IbillService_sendBill_message_FaultMessage"><wsdl:part name="detail" element="tns:message"/></wsdl:message><wsdl:portType name="IbillService"><wsdl:operation name="sendSummary"><wsdl:input wsaw:Action="urn:sendSummary" name="sendSummaryRequest" message="tns:sendSummaryRequest"/><wsdl:output wsaw:Action="http://service.sunat.gob.pe/IbillService/sendSummaryResponse" name="sendSummaryResponse" message="tns:sendSummaryResponse"/><wsdl:fault wsaw:Action="http://service.sunat.gob.pe/IbillService/sendSummarymessage" name="message" message="tns:IbillService_sendSummary_message_FaultMessage"/></wsdl:operation><wsdl:operation name="getStatus"><wsdl:input wsaw:Action="urn:getStatus" name="getStatusRequest" message="tns:getStatusRequest"/><wsdl:output wsaw:Action="http://service.sunat.gob.pe/IbillService/getStatusResponse" name="getStatusResponse" message="tns:getStatusResponse"/><wsdl:fault wsaw:Action="http://service.sunat.gob.pe/IbillService/getStatusmessage" name="message" message="tns:IbillService_getStatus_message_FaultMessage"/></wsdl:operation><wsdl:operation name="sendPack"><wsdl:input wsaw:Action="urn:sendPack" name="sendPackRequest" message="tns:sendPackRequest"/><wsdl:output wsaw:Action="http://service.sunat.gob.pe/IbillService/sendPackResponse" name="sendPackResponse" message="tns:sendPackResponse"/><wsdl:fault wsaw:Action="http://service.sunat.gob.pe/IbillService/sendPackmessage" name="message" message="tns:IbillService_sendPack_message_FaultMessage"/></wsdl:operation><wsdl:operation name="getStatusCdr"><wsdl:input wsaw:Action="urn:getStatusCdr" name="getStatusCdrRequest" message="tns:getStatusCdrRequest"/><wsdl:output wsaw:Action="http://service.sunat.gob.pe/IbillService/getStatusCdrResponse" name="getStatusCdrResponse" message="tns:getStatusCdrResponse"/><wsdl:fault wsaw:Action="http://service.sunat.gob.pe/IbillService/getStatusCdrmessage" name="message" message="tns:IbillService_getStatusCdr_message_FaultMessage"/></wsdl:operation><wsdl:operation name="sendBill"><wsdl:input wsaw:Action="urn:sendBill" name="sendBillRequest" message="tns:sendBillRequest"/><wsdl:output wsaw:Action="http://service.sunat.gob.pe/IbillService/sendBillResponse" name="sendBillResponse" message="tns:sendBillResponse"/><wsdl:fault wsaw:Action="http://service.sunat.gob.pe/IbillService/sendBillmessage" name="message" message="tns:IbillService_sendBill_message_FaultMessage"/></wsdl:operation></wsdl:portType></wsdl:definitions>